# encoding: utf-8 #
from __future__ import unicode_literals
from __future__ import print_function

import random

def unicodify(string):
    chars = {
        "a":["ⱥ", "Ⱥ", "ǡ", "ǟ", "ã", "ä", "å", "ɑ"], 
        "b":["Ƀ", "б", "ƀ", "Ɓ", "Ѣ"],
        "c":["ƈ", "ȼ"],
        "d":["ȡ", "ԃ", "ð"],
        "e":["ɘ", "ԑ", "ҿ", "ҽ", "ë", "ɛ", "Ɇ", "ɇ"],
        "f":["ƒ", "ғ"],
        "g":["ʛ", "ǥ", "ɠ"],
        "h":["ɧ", "ӈ", "ħ", "ɦ"],
        "i":["ɨ", "ĩ", "ï", "Ɨ"],
        "j":["ʝ", "ɉ", "Ɉ"],
        "k":["ʞ", "ԟ", "ӄ", "ƙ"],
        "l":["℄", "Ŀ", "ł", "ŀ", "ȴ"],
        "m":["ო", "ɱ"],
        "n":["ɲ", "и", "ñ", "ȵ", "ɳ"],
        "o":["ȏ", "ʘ", "õ", "ö", "ø", "ơ"],
        "p":["þ", "Ƥ", "ƥ"],
        "q":["ʠ", "ɋ"],
        "r":["ʁ", "я", "Ʀ", "ȑ", "ȓ"],
        "s":["ʂ", "ƨ", "ȿ"],
        "t":["ȶ", "ԏ", "ƭ", "ŧ"],
        "u":["ʉ", "ů", "ũ", "ǚ", "ü", "ư", "Ʉ"],
        "v":["Ʋ", "ѵ"],
        "w":["ѡ"],
        "x":["χ", "ӿ", "ӽ", "ҳ"],
        "y":["ɣ", "ÿ", "ƴ", "ϓ", "ϒ",],
        "z":["ʐ", "ʑ", "ɀ"],
        "?": ["ʡ"],
        "2": ["ƻ"],
        "3": ["ƺ", "ȝ", "з"],
        "5": ["Ƽ"],
        "8": ["ȣ"]
    }

    newstring = ""
    for c in string.lower():
        try:
            newstring += random.choice(chars[c])
        except:
            newstring += c

    return newstring

if __name__ == "__main__":
   print(unicodify("the quick brown fox jumped over the lazy dog"))
